================================================================================
Constant Int Base10 w/ Type
================================================================================

const name: Int = 100

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (type_definition (type_identifier))
   (constant_value (int (base10)))))

================================================================================
Constant Int Base10 w/o Type
================================================================================

const name = 100

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (constant_value (int (base10)))))

================================================================================
Constant Int Base16 w/ Type
================================================================================

const name: Int = 0xaa

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (type_definition (type_identifier))
   (constant_value (int (base16)))))

================================================================================
Constant Int Base16 w/o Type
================================================================================

const name = 0xaa

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (constant_value (int (base16)))))

================================================================================
Constant Int base10_underscore w/ Type
================================================================================

const name: Int = 1_000_000

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (type_definition (type_identifier))
   (constant_value (int (base10_underscore)))))

================================================================================
Constant Int base10_underscore w/o Type
================================================================================

const name = 1_000_000

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (constant_value (int (base10_underscore)))))

================================================================================
Constant String w/ Type
================================================================================

const name: String = @"ilikecardano"

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (type_definition (type_identifier))
   (constant_value (string (string_inner)))))

================================================================================
Constant String w/o Type
================================================================================

const name = @"ilikecardano"

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (constant_value (string (string_inner)))))

================================================================================
Constant Bytes w/ Type + #
================================================================================

const name: Bytes = #"deadbeef"

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (type_definition (type_identifier))
   (constant_value (bytes (string_inner)))))

================================================================================
Constant Bytes w/o Type + #
================================================================================

const name = #"deadbeef"

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (constant_value (bytes (string_inner)))))

================================================================================
Constant Bytes w/ Type
================================================================================

const name: Bytes = "deadbeef"

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (type_definition (type_identifier))
   (constant_value (bytes (string_inner)))))

================================================================================
Constant Bytes w/o Type
================================================================================

const name = "deadbeef"

--------------------------------------------------------------------------------

(source_file
  (constant (identifier)
   (constant_value (bytes (string_inner)))))

================================================================================
Constant with qualified types
================================================================================

const administrator: multisig.MultisigScript =
  multisig.AtLeast { required: config.required, scripts: config.scripts }

--------------------------------------------------------------------------------

(source_file
      (constant
        (identifier)
        (type_definition
          (identifier)
          (type_identifier))
        (constant_value
          (match_pattern
            (identifier)
            (type_identifier)
            (field_capture_element
              (identifier)
              (expression
                (field_access
                  (identifier)
                  (field_identifier))))
            (field_capture_element
              (identifier)
              (expression
                (field_access
                  (identifier)
                  (field_identifier))))))))